// Посчитать общую сумму покупок в корзине

const cart = [54, 28, 105, 70, 92, 17, 120];
// 2.сделать переменую total до цикла
let total = 0;
// 1.перебрать масив в цикле
// for (let i = 0; i < cart.length; i += 1){
//   console.log(cart[i]);
//   // 3. каждий елемент + тотал
//   total += cart[i];
// }

// краще використати фор оф так як нам не треба міняти значеня масивів
// фор оф якщо просто треба доступ до елементу 
// фор якщо нам треба переопреділити значення елеентів  
for (const value of cart) {
    total += value;  
}


console.log('Total:', total);


// добавить каждоиу по 10% +

// for (let i = 0; i < cart.length; i += 1){
//     cart[i] = Math.round(cart[i] * 1.1);
// }

// console.log(cart);




