// Напиши скрипт оработки покупки в магазине.
// --Баланс пользователя храниться в переменно1-balance;
// --Сумма покупки храниться в переменной -Payment;
// **ПЕред проверкой вывести сообщение:
// ___Общая стоимость закааза (число) крудитов.
// проверяем кол-во доступных средств на счету
// Если сумма покупки не превышает баланс:
// ----Вычесть из баланса сумму покупки
// ----Вывести сообщение (На счету осталось ...крудитов)
// --Если сумма покупки превышает баланс:
// ---вывести сообщение ( на счету недостаточно средств для операции)
// -- в конце вывести сообщение ( операция завершена)


let balance = 10000;
const payment = 2000;


// все хорошо, снимаем деньги .....спасибо за покупку !!!