// type module робить скрпит 'use srtict' автоматичною
// переменная-имя,идентификатор.ЯЧЕЙКА В ПАМЯТИ ;
// ключевое слово-const and let
//  имя переменной (age, mesagge) и тд.має відповідати на запатиння: Что это такое ?;
// булеві значення мають відповідати на запитання: А єто будет или нет?Надо делать или нет, включен или віключен, 
// сидит или стоит  ответ либо тру либо фолс на фолс есть всего 6 значений. все осталное будет тру?
//для того щоб вивести фнформацію в консоль раузера використовуєм console.log()
//
// 
// 


const age = 10;
const totalPrice = 200.74;
const userName = 'Chelsey';
const mesagge = 'Добро Пожаловать';
const isOpen = true;
const shouldConfirm = false;


// type off

const type = typeof '5';
console.log(type);

// allert-блокую интерпритацію, нічого не буде виконано доки користувач не натисне ок ;
alert('З 8 березня маленькі')