//Создайте функцию, которая принимает целое число в качестве аргумента и возвращает значение "Even"для четных или "Odd"нечетных чисел.

// function evenOrOdd(number) {
//   if (number % 2 === 0) {
//     return 'Even';
//   } else {
//     return 'Odd';
//   }
// }



//Создайте функцию с двумя аргументами, которая будет возвращать массив первых nкратных x.

//Предположим, что и заданное число, и количество раз для подсчета будут положительными числами больше, чем 0.

//Возвращайте результаты в виде массива или списка (в зависимости от языка).
// function countBy(x, n) {
//   let z = [];

//   for (let i = 1; i <= n; i++) {
//     z.push(x * i);
//   }
//   return z;
// }

// console.log(countBy(1, 10));
// console.log(countBy(2, 5)); 


//Реализуйте функцию, которая преобразует данное логическое значение в его строковое представление.

//Примечание. Будут даны только действительные входные данные.

// function booleanToString(b) {
//   return b.toString();
// }



//function booleanToString(b) {
 // return b ? 'true' : 'false';
//}